app/controllers/access_level_controller.rb

SELECT "access_levels".* FROM "access_levels"
---
    def list
        @access_levels = AccessLevel.all

INSERT INTO "access_levels" ("name", "created_at") VALUES ($1, $2) RETURNING "id"  [["name", "Admin"], ["created_at", "2021-11-27 07:44:20.480187"]]
---
    def create
        @access_levels = AccessLevel.new(access_level_params)

        if @access_levels.save!