app/controllers/authentication_controller.rb

    def signin
      user = User.find_by(email: user_params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test@test.com"], ["LIMIT", 1]]

    def dashboard
      @users = User.all
      @sales = Sale.all
      @totalRevenues=0;
      @quantitySold=0;
      @sales.each do |c|
        @totalRevenues=@totalRevenues+ c.price*c.quantity;
        @quantitySold = @quantitySold + c.quantity;
      end
      @products = Product.all
      @totalProducts=0;
      @products.each do |c|
---
SELECT "users".* FROM "users"
SELECT "sales".* FROM "sales"
SELECT "products".* FROM "products"