app/controllers/product_controller.rb

    def create
        @products = Product.new(product_params)

        if @products.save!
---
INSERT INTO "products" ("user_id", "name", "price", "description", "quantity", "created_at", "imagename") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["user_id", 1], ["name", "Tanganda"], ["price", 1.0], ["description", "1"], ["quantity", 1], ["created_at", "2021-12-01 14:36:24.769413"], ["imagename", "eng"]]

    def update
        @products = Product.find(params[:id])

        if @products.update(product_params)
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "products" SET "description" = $1 WHERE "products"."id" = $2  [["description", "tessdafdgfhgjsgwqretyukt"], ["id", 5]]

    def delete
        @products = Product.find(params[:id])

        if @products.update(:isDeleted=> true)
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "products" SET "isDeleted" = $1 WHERE "products"."id" = $2  [["isDeleted", true], ["id", 2]]