app/controllers/product_image_controller.rb

  def index
    @product_images = ProductImage.all
---
SELECT "product_images".* FROM "product_images"

 def create
    @product_image = ProductImage.new(resume_params)
    @product_image.id=session[:product_id]
    @products = Product.find(session[:product_id])
    @products.update(:imageurl=> "/uploads/product_image/attachment/#{session[:product_id]}/"+params[:product_image][:attachment].original_filename.gsub(" ", "_").gsub("#", "_"))
    if @product_image.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "product_images" SET "updated_at" = $1 WHERE "product_images"."id" = $2  [["updated_at", "2021-12-01 07:04:53.879127"], ["id", 14]]
UPDATE "products" SET "imageurl" = $1 WHERE "products"."id" = $2  [["imageurl", "/uploads/product_image/attachment/3/bike.jpeg"], ["id", 3]]
INSERT INTO "product_images" ("id", "name", "attachment", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["id", 3], ["name", "3"], ["attachment", "#<ActionDispatch::Http::UploadedFile:0x00007fb922522730>"], ["created_at", "2021-11-27 07:49:33.531242"], ["updated_at", "2021-11-27 07:49:33.531242"]]

 def destroy
    @product_image = ProductImage.find(params[:id])
    @product_image.destroy
---
SELECT "product_images".* FROM "product_images" WHERE "product_images"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
DELETE FROM "product_images" WHERE "product_images"."id" = $1  [["id", 15]]