app/controllers/sale_controller.rb

INSERT INTO "sales" ("product_id", "date", "price", "quantity", "created_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["product_id", 4], ["date", "2021-12-01"], ["price", 1.0], ["quantity", 1], ["created_at", "2021-12-01 14:58:54.403164"]]
---
    def sale
        # duration = Time.at(duration).utc.strftime("%M:%S")
        if session[:customerArrivalTimestamp]!=nil
        puts "***********************"
        puts Time.at(Time.now.to_time.to_i - session[:customerArrivalTimestamp]).utc.strftime("%M");
        puts "***********************"
        end
        session[:customerArrivalTimestamp]=nil
        session[:amountToBePaid]=0;
        session[:cart].each do |c|
            if c["quantity"].to_i>0
                @sales = Sale.new(:product_id=>c["product_id"],:quantity=>c["quantity"], :price=>c["price"],:date=>c["date"])
                session[:amountToBePaid]=session[:amountToBePaid]+c["quantity"].to_i*c["price"].to_i;
                @sales.save