app/controllers/user_controller.rb

    def list
        @users = User.all
---
SELECT "users".* FROM "users"

    def show
        @access_levels = AccessLevel.all
        @user = User.find(params[:id])
---
SELECT "access_levels".* FROM "access_levels"
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def new
        @access_levels = AccessLevel.all
---
SELECT "access_levels".* FROM "access_levels"

    def create
        @users = User.new(user_params)

        if @users.save!
---
INSERT INTO "users" ("access_level_id", "name", "email", "password", "address", "created_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["access_level_id", 1], ["name", "test@test.com"], ["email", "test@test.com"], ["password", "test@test.com"], ["address", "200 nsw, aust"], ["created_at", "2021-11-27 07:45:10.473164"]]

    def update
        @users = User.find(params[:id])

        if @users.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "address" = $1 WHERE "users"."id" = $2  [["address", "200 nsw, aust 00"], ["id", 1]]